# ğŸ“Š CSVãƒ•ã‚¡ã‚¤ãƒ«ãƒ“ãƒ¥ãƒ¼ã‚¢ãƒ¼

Titanicãƒ‡ãƒ¼ã‚¿ã‚»ãƒƒãƒˆã®CSVãƒ•ã‚¡ã‚¤ãƒ«ã‚’ç°¡å˜ã«è¡¨ç¤ºã—ã¾ã™ã€‚

In [1]:
import pandas as pd
import numpy as np

print("âœ… ãƒ©ã‚¤ãƒ–ãƒ©ãƒªèª­ã¿è¾¼ã¿å®Œäº†")

âœ… ãƒ©ã‚¤ãƒ–ãƒ©ãƒªèª­ã¿è¾¼ã¿å®Œäº†

## 1. è¨“ç·´ãƒ‡ãƒ¼ã‚¿ (train.csv)

In [2]:
# è¨“ç·´ãƒ‡ãƒ¼ã‚¿ã®èª­ã¿è¾¼ã¿
train_df = pd.read_csv('Titanic - Machine Learning from Disaster/titanic/train.csv')

print(f"ğŸ“Š ãƒ‡ãƒ¼ã‚¿ã‚µã‚¤ã‚º: {train_df.shape[0]}è¡Œ Ã— {train_df.shape[1]}åˆ—")
print(f"ğŸ“‹ åˆ—å: {list(train_df.columns)}")
print("\n" + "="*80)

# æœ€åˆã®10è¡Œã‚’è¡¨ç¤º
train_df.head(10)

ğŸ“Š ãƒ‡ãƒ¼ã‚¿ã‚µã‚¤ã‚º: 891è¡Œ Ã— 12åˆ—
ğŸ“‹ åˆ—å: ['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

================================================================================

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [3]:
# åŸºæœ¬çµ±è¨ˆæƒ…å ±
print("ğŸ“ˆ åŸºæœ¬çµ±è¨ˆæƒ…å ±")
print("="*30)
train_df.describe()

ğŸ“ˆ åŸºæœ¬çµ±è¨ˆæƒ…å ±
==============================

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
# æ¬ æå€¤ã®ç¢ºèª
missing = train_df.isnull().sum()
print("âš ï¸ æ¬ æå€¤ã®ç¢ºèª")
print("="*30)
for col, count in missing.items():
    if count > 0:
        percentage = (count / len(train_df)) * 100
        print(f"{col}: {count}ä»¶ ({percentage:.1f}%)")
    else:
        print(f"{col}: æ¬ æãªã—")

âš ï¸ æ¬ æå€¤ã®ç¢ºèª
==============================
PassengerId: æ¬ æãªã—
Survived: æ¬ æãªã—
Pclass: æ¬ æãªã—
Name: æ¬ æãªã—
Sex: æ¬ æãªã—
Age: 177ä»¶ (19.9%)
SibSp: æ¬ æãªã—
Parch: æ¬ æãªã—
Ticket: æ¬ æãªã—
Fare: æ¬ æãªã—
Cabin: 687ä»¶ (77.1%)
Embarked: 2ä»¶ (0.2%)

## 2. ãƒ†ã‚¹ãƒˆãƒ‡ãƒ¼ã‚¿ (test.csv)

In [5]:
# ãƒ†ã‚¹ãƒˆãƒ‡ãƒ¼ã‚¿ã®èª­ã¿è¾¼ã¿
test_df = pd.read_csv('Titanic - Machine Learning from Disaster/titanic/test.csv')

print(f"ğŸ“Š ãƒ‡ãƒ¼ã‚¿ã‚µã‚¤ã‚º: {test_df.shape[0]}è¡Œ Ã— {test_df.shape[1]}åˆ—")
print(f"ğŸ“‹ åˆ—å: {list(test_df.columns)}")
print("\n" + "="*80)

# æœ€åˆã®10è¡Œã‚’è¡¨ç¤º
test_df.head(10)

ğŸ“Š ãƒ‡ãƒ¼ã‚¿ã‚µã‚¤ã‚º: 418è¡Œ Ã— 11åˆ—
ğŸ“‹ åˆ—å: ['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

================================================================================

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [6]:
# ãƒ†ã‚¹ãƒˆãƒ‡ãƒ¼ã‚¿ã®æ¬ æå€¤
missing_test = test_df.isnull().sum()
print("âš ï¸ ãƒ†ã‚¹ãƒˆãƒ‡ãƒ¼ã‚¿ã®æ¬ æå€¤")
print("="*30)
for col, count in missing_test.items():
    if count > 0:
        percentage = (count / len(test_df)) * 100
        print(f"{col}: {count}ä»¶ ({percentage:.1f}%)")
    else:
        print(f"{col}: æ¬ æãªã—")

âš ï¸ ãƒ†ã‚¹ãƒˆãƒ‡ãƒ¼ã‚¿ã®æ¬ æå€¤
==============================
PassengerId: æ¬ æãªã—
Pclass: æ¬ æãªã—
Name: æ¬ æãªã—
Sex: æ¬ æãªã—
Age: 86ä»¶ (20.6%)
SibSp: æ¬ æãªã—
Parch: æ¬ æãªã—
Ticket: æ¬ æãªã—
Fare: 1ä»¶ (0.2%)
Cabin: 327ä»¶ (78.2%)
Embarked: æ¬ æãªã—

## 3. ã‚µãƒ³ãƒ—ãƒ«æå‡ºãƒ•ã‚¡ã‚¤ãƒ« (gender_submission.csv)

In [7]:
# ã‚µãƒ³ãƒ—ãƒ«æå‡ºãƒ•ã‚¡ã‚¤ãƒ«ã®èª­ã¿è¾¼ã¿
gender_submission = pd.read_csv('Titanic - Machine Learning from Disaster/titanic/gender_submission.csv')

print(f"ğŸ“Š ãƒ‡ãƒ¼ã‚¿ã‚µã‚¤ã‚º: {gender_submission.shape[0]}è¡Œ Ã— {gender_submission.shape[1]}åˆ—")
print(f"ğŸ“‹ åˆ—å: {list(gender_submission.columns)}")
print("\n" + "="*80)

# æœ€åˆã®10è¡Œã‚’è¡¨ç¤º
gender_submission.head(10)

ğŸ“Š ãƒ‡ãƒ¼ã‚¿ã‚µã‚¤ã‚º: 418è¡Œ Ã— 2åˆ—
ğŸ“‹ åˆ—å: ['PassengerId', 'Survived']

================================================================================

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1
5          897         0
6          898         1
7          899         0
8          900         1
9          901         0

In [8]:
# ã‚µãƒ³ãƒ—ãƒ«æå‡ºã®çµ±è¨ˆ
print("ğŸ“ˆ ã‚µãƒ³ãƒ—ãƒ«æå‡ºã®çµ±è¨ˆ")
print("="*30)
print(f"ç”Ÿå­˜äºˆæ¸¬: {gender_submission['Survived'].sum()}äºº")
print(f"æ­»äº¡äºˆæ¸¬: {(gender_submission['Survived'] == 0).sum()}äºº")
print(f"ç”Ÿå­˜ç‡äºˆæ¸¬: {gender_submission['Survived'].mean():.3f} ({gender_submission['Survived'].mean()*100:.1f}%)")

ğŸ“ˆ ã‚µãƒ³ãƒ—ãƒ«æå‡ºã®çµ±è¨ˆ
==============================
ç”Ÿå­˜äºˆæ¸¬: 152äºº
æ­»äº¡äºˆæ¸¬: 266äºº
ç”Ÿå­˜ç‡äºˆæ¸¬: 0.364 (36.4%)

## 4. ãƒ‡ãƒ¼ã‚¿ã®æ¯”è¼ƒ

In [9]:
print("ğŸ“Š ãƒ‡ãƒ¼ã‚¿ã‚»ãƒƒãƒˆã®æ¯”è¼ƒ")
print("="*50)
print(f"è¨“ç·´ãƒ‡ãƒ¼ã‚¿: {train_df.shape[0]}è¡Œ Ã— {train_df.shape[1]}åˆ—")
print(f"ãƒ†ã‚¹ãƒˆãƒ‡ãƒ¼ã‚¿: {test_df.shape[0]}è¡Œ Ã— {test_df.shape[1]}åˆ—")
print(f"ã‚µãƒ³ãƒ—ãƒ«æå‡º: {gender_submission.shape[0]}è¡Œ Ã— {gender_submission.shape[1]}åˆ—")

print("\nğŸ” ä¸»ãªé•ã„:")
print("â€¢ è¨“ç·´ãƒ‡ãƒ¼ã‚¿ã«ã¯ 'Survived' åˆ—ãŒã‚ã‚‹ï¼ˆæ•™å¸«ãƒ‡ãƒ¼ã‚¿ï¼‰")
print("â€¢ ãƒ†ã‚¹ãƒˆãƒ‡ãƒ¼ã‚¿ã«ã¯ 'Survived' åˆ—ãŒãªã„ï¼ˆäºˆæ¸¬å¯¾è±¡ï¼‰")
print("â€¢ ã‚µãƒ³ãƒ—ãƒ«æå‡ºã¯æ€§åˆ¥ãƒ™ãƒ¼ã‚¹ã®ç°¡å˜ãªäºˆæ¸¬ä¾‹")

ğŸ“Š ãƒ‡ãƒ¼ã‚¿ã‚»ãƒƒãƒˆã®æ¯”è¼ƒ
==================================================
è¨“ç·´ãƒ‡ãƒ¼ã‚¿: 891è¡Œ Ã— 12åˆ—
ãƒ†ã‚¹ãƒˆãƒ‡ãƒ¼ã‚¿: 418è¡Œ Ã— 11åˆ—
ã‚µãƒ³ãƒ—ãƒ«æå‡º: 418è¡Œ Ã— 2åˆ—

ğŸ” ä¸»ãªé•ã„:
â€¢ è¨“ç·´ãƒ‡ãƒ¼ã‚¿ã«ã¯ 'Survived' åˆ—ãŒã‚ã‚‹ï¼ˆæ•™å¸«ãƒ‡ãƒ¼ã‚¿ï¼‰
â€¢ ãƒ†ã‚¹ãƒˆãƒ‡ãƒ¼ã‚¿ã«ã¯ 'Survived' åˆ—ãŒãªã„ï¼ˆäºˆæ¸¬å¯¾è±¡ï¼‰
â€¢ ã‚µãƒ³ãƒ—ãƒ«æå‡ºã¯æ€§åˆ¥ãƒ™ãƒ¼ã‚¹ã®ç°¡å˜ãªäºˆæ¸¬ä¾‹